performance-test.yml
config:
  target: "http://localhost:80"
  phases:
    - duration: 5
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
  socketio:
    transports: ['websocket']
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - 'socketio.response_time.mean': 200

before:
  flow:
    - post:
        url: "/api/register"
        json:
          username: "{{ $randomString(10) }}"
          password: "password123"
        capture:
          - json: "$.userId"
            as: "userId1"
          - json: "$.userName"
            as: "userName1"
    - post:
        url: "/api/register"
        json:
          username: "{{ $randomString(10) }}"
          password: "password123"
        capture:
          - json: "$.userId"
            as: "userId2"
          - json: "$.userName"
            as: "userName2"
    - post:
        url: "/api/login"
        json:
          username: "{{ userName1 }}"
          password: "password123"
        capture:
          - json: "$.authKey"
            as: "authKey1"

scenarios:
  - engine: "socketio"
    socketio:
      extraHeaders:
        authorization: "{{ authKey1 }}"
    flow:
      - emit:
          channel: "group:create"
          data:
            name: "Test Group {{ $randomNumber(1, 1000) }}"
            members: ["{{ userId1 }}", "{{ userId2 }}"]
        response:
          on: "group:created"
          capture:
            json: "$[0]"
            as: "createdGroup"
      # - log: "createdGroup: {{ createdGroup }}"
      - loop:
          - emit:
              channel: "message:create"
              data:
                groupId: "{{ createdGroup._id }}"
                text: "Hello World!"
        count: 500